Repository: K227-arch/Rasberry-model
Catalog: runyoro_nmt/data/tm/runyoro_en.tmx
Source language: nyk
Languages: en

source: omuhiigi obu abona enyamaiswa ataisura embwa ze kugihambya; omusaija ayataisuliire abagenzi embwa ze bakamutaho omusango; omunyankomo ataisw1n11e
en: When a hunter sights an animal, he releases his dogs to chase it; The man who released his dogs to travellers was charged with a criminal case; The prisoner has been released. -taito, adj. Small, little, tinny, few, =ke

source: Tajeemerwa
en: One of the Royal drums

source: talibana
en: To work alone and very hard, do ail the work oneself

source: -namwandu atalibana muno wenka omumakage.
en: -the widow always works alone at her home.

source: taliga
en: To be busy

source: -taata ataliga muno buli runaku.
en: -my dad is always busy in a day.

source: taliikiriza
en: T dry at fire

source: taliiriza
en: To turn a side, avoid

source: nkabasanga beemeriire omumuhanda hagati Nyowe nata/iiriza mpora nabarabaho
en: , l found them standing in the middle of the way and turned aside and passed by them

source: talika
en: To dry meat over the fire grill

source: obu anywa amaanva; kira ebiro bisalu
en: Mukazi we araara amuta/ikire,, when he takes alcohol he scolds his wife till morning; For meat to be quHe dry, it is grilled for three days

source: talikiza
en: To sit with legs wide apart

source: akaanya kataito obu orukukatalikirizaamu abantu abandi nibaburwa h 'okwikaarra
en: If you sit with legs apart in a small space, other people will not have where to sit.

source: taliza
en: To leave (tree) in the ground, disturb, hinder

source: tama
en: To disgust, sicken, weary

source: akantamira orugambo nve; obu obazaaho kubi mugenzi waawe omutamisa abantu; akatamwa buli muntu
en: Be/she makes me disgusted because of rumour mongering; If you spek iU of your neighbour you make people be weary of him/her; Every one gets sick of him/her

source: tamba
en: To execute, offer (sacrince), cure, heal, ward off

source: poliisi ekatamba kukwata omusuma owaakaba atuntwize ekyaro; omufumu onu atambira sente nke muno; atambisa emibazi y 'Ekitooro; enu endwara neetambwa Abarukwiragura
en: The police did a commendable job to arrest a thief who used to terrorize people in the village; This doctor asks for very little money for treatment; He/she uses Kitooro herbs to cure people of their diseases; This disease is curable by African traditional healers

source: tambikiza
en: Pr. Of c. Form, tambikiriza, ku-, oku-

source: toina mbere oratambikiriza amagun1, Omwanya oikaliremu mufunda
en: , you have not enough space where to stridey our legs

source: tambuka
en: To stride across, step over

source: akamttjunaana habw 'okumutambukira ebyokulya
en: He/she blamed her/him for having strode across his/her food

source: tamburra
en: Tambuurra tana to distribute meat (esp. Remains of carcass to hunters)

source: amagun1; e11yama y'ekisoro bagitambuurra omukisaka; enyama y'ekisoro ky'omukisaka etamburwa hali abo bonka abagihiigire
en: Stride; Meat from the carcass of an animal killed by bunters is distributed while the hunters are in the bush; Meat of a hunted animal is shared only among those who participated in the bunt

source: tambuurra
en: To remove a spell, exorcise

source: tamiira
en: To get drunk, become intoxicated

source: atamiire amaanva g 'ebitooke; amaarwa tibagatamiirra buko
en: He is drunk of banana wine; People do not get drunk at the home of their in-laws

source: tamiirukuka
en: To get sober, wake from drunken sleep

source: obu yatamiire akatamiinikukira ekiro kyo11a; ebicwe by'enyama nibyo byamwamiinikukize
en: When he/she got drunk it took him/her the whole day to get sober; He/she was helped by meat soup to get sober

source: tamika
en: To put food into mouth of (another)

source: omwwaire bamutamikil'a kubunva amaani g'okwetamika; omuntu ebyokulya bakira kubimutamikisa egiiko
en: People put food into the mouth of a patient because he/she is unable to put it into his/ her mouth; We use a table spoon to put food into one's mouth

source: tamura
en: To take out of mouth of another (usually child)

source: amata abaire naanywa abasuma bagamutamwire kwiba ente ye
en: The thieves have deprived him/her of the milk be/she has been drinking following the theft of bis/her cow

source: tamuza
en: To remove sucking calf from one teat to another so as to induce milk in all teats

source: tamwa
en: To be weary of, hate, loathe

source: tamya
en: To induce disgust

source: ekillooya kye kitanire; ataniire Kasunganyanja; atanire kumanya habwaki omwana wange atii1·e owe
en: Nikyetaaga omubazi ogw 'amaani kukiraho, his/her sore has grown worse, it needs much more strong medicine to heal it; Be/ she has taken hls/her commodities to Kasunganyanja market; He/ she came angrily to find out wby my child hit his/hers

source: tanaka
en: To vomit, be sick

source: abaana nubo bakanya muno kutanakira omubbaasi; haroho emibazi enyakutanakya abarwaire
en: It is mostly children who vomit in buses while traveling; There are some medicines which make patients vomit

source: tananuka
en: Inconvincible

source: tanda
en: To stride, take a long step

source: amaguru
en: Stand astride

source: tandaaza
en: To spread (e.g. Cement)

source: enju ye abafundi bakagitm1daaliza ebiro bisatu
en: Builders took three days to spread cement on the floor of his house

source: tandagaraza
en: To spread out the legs

source: tandalika
en: To stretch out (as a tent)

source: tandama
en: To stand astride,kneel with legs apart

source: tandiika
en: To saddle, harness (a riding animal)

source: obulemu obw 'okucungw·a Uganda bukatandikira luwero; Tusiime agonza muno omwegesa we ayamutandikisize kusoma n 'okuhandiika; obulemu obwa kabiri obw 'ensi yoona bukatandikwa Adolf Hitler (1939 - 1945)
en: The war to liberate Uganda started in Luwero; Tusiime loves his teacher who first taught him how to read and write; The second world war was started by Adolf Hitler in ( 1939 - 1945)

source: tandukuurra
en: To unsaddle, clear away

source: akasanga tumazire ira kulya n"emeza bagitandukurwire ira; akaba agenzire
en: He/ she found that we had already finished eating and the table had already been cleared up. Tangs. She had already gone, but her husband stopped her while on the way

source: Tangiira
en: To meet and welcome a guest

source: tangaara
en: : to be astonished, wonder, marvel

source: abantu bakatangaarra ebyamahano yabakoorraaga
en: People maf\>eled at the miracles he performed before them

source: tangaaza
en: To astonish, look through a telescope

source: tangiirra
en: To meet and welcome a guest

source: Omuroleerezi bamutangiririire omumaduuk.a Fort po11al; omukuras1 wabo bakamutangiriza elcimuli; akabatangisiza habw.okugya habbaasi
en: The Bishop was welcome at the shops, in Fort portal; They welcomed their councilor with a bouquet of flowers-; He/she gained advantage at their epense because he/she was going to the bus park

source: tanisa
en: To take for sale, make septic

source: agiire kutanisa ebihimba bye; ente zigira akatale kaazo aka baitamsizaamu; oburunguru butanisibwa omukataale ka Hima
en: She has taken her beans to market; Cattle have their own market where people take them for sale; Onions are sold at Hima market

source: tanuka
en: To grow worse, spread

source: ekihooya kye kibaire kyas1sana ekirukwoma; ira amaiz1 g'enjura bagatangiririzaga hkitooke rundi hamutoma; Busaho n 'omu ayamanyire ekyamutanuukiriize 11a mugenzi we
en: Baifll hati kitanukire buhyaka, his/her sore looked as if it was gettingdry, but it isnow septic. Tanukiirra ku-, oku-, v.tr; In the past ram water was tapped from a plantain or barkcloth tree; Nobody knows what caused the qurrel between him/her and his/her compamon

source: tanwa
en: To accidentally, meet with an accident

source: tara
en: To move about, wander about, stagger, reel

source: omuntu obu ataarra omubantu abatamumanyire tabatungiramu businge; enaku nizo itaza omuntu
en: When a person wanders about amongst people who do not know him/her, he/she gets no peace from them; It is need which makes people wander about

source: obu yasangire amahe gaatara haka ye aho yamanya; enjuye akagitalilwa omufundi ayayegesiibwe omu byamaju
en: Nkooku a/i omukobi, it is when he found soldiers marshaled around bis home, that he realized he was in danger; The site for his house was measured by a trained builder

source: taraaka
en: To splash up, gush out

source: akarabya nwtoko ye omumaizi g'omuruguudo amaizi gaataraaldra abantu
en: He drove his/her car through a puddle in the road and splashed waler on people

source: tarama
en: To be wide (e.g. Basket), be shallow

source: tarantuka
en: To stagger

source: taruka
en: To trip up

source: taruuka
en: To shed (skin, bark)

source: tata
en: To spy on

source: tatento
en: , my paternal uncle

source: taza
en: To take about, make to travel, spread (report)

source: teba
en: To grow weary, be limp

source: omuntu amanyire ebyenseke nuwe atebera abanyubenyzmgu enseke
en: It's one who knows all about pipes who molds pipes for pipe smokers and fits them into their bowls

source: abaisiki abamu bakira muno klltebwa aboojo
en: Some girls are hoaxed by boys

source: tebeekana
en: To be dutiful, docile, agree

source: tebeekaniza
en: To steer, keep straight

source: tebeekera
en: To give permission to, leave it to fate, agree, assent

source: tebeekera nk 'owaatwanwa amaizi
en: Leave it to fate like a drawing person

source: tebeekeza
en: To learn (how to do) properly

source: atebeekiize hati kuvuga matoka
en: He/she is now steady in driving a car

source: tebeza
en: To inform, tell, preach

source: akatebereza Namugongo abasomi boona baamugayuka
en: He preached at Namugongo and all the faithful appreciated his sermon

source: tebura
en: To speak sarcastically to, mock, flatter

source: tebya
en: Converse, narrate, tell news

source: ebigambo ebi bitebiibwe abahuliirege orubazo rwe
en: The news was told by those who listened to his/her talk

source: teeba
en: To aim at, guess, score

source: Byengonzi akateebera tiimu ye gooro ibiri
en: Byengonzi scored two goals for his team

source: teega
en: To be on heat (cows, etc.)

source: ente ze zikaburwa enimi ey'okuziteegesa
en: His cattle lacked a bull to entice them on tecga teckura heat

source: teeka
en: To be calm, clear, settle (as muddy liquid)

source: enyaanya bakaiteekera abaguzi
en: They put tomatoes in heaps for buyers

source: teekaana
en: To become calm, settled, harmonious

source: obugenyi abuteekaniriize omutabani arogire Bulaaya; akagenda kuteekanizisa Rwakijuma obugenyi bw'omutabani
en: He/she bas prepared a feast for his son who has returned from Europe; He/she went to help Rwakijuma prepare a feast for his son

source: teekera
en: To sharpen {knife)

source: emihyo n 'amacumu baabiteekeerra hamahyoro; abantu abandi bateekeza muyamba
en: People sharpen knives and spears on wetstones; Some other people sharpen tools with a file

source: teekereza
en: To think, consider, suppose

source: Ruhanga atutanga kuteekerereza busa bagenzi bairu ngu nubo bakozire ekintu ekibi nanka; ebiteekerezo eby 'obusinge biteekerezibwa Ruhanga
en: God forbids us to think unfoundedly bad acts about our neigbbbors; Thoughts of peace are thought by God

source: teekura
en: To take off, displace, remove

source: ow'okumuteekuurraaho ebyokulya bye akamubura; habugenyi abasaija nubo bateekuzaaho abakazi ebyokulya hamahega; ebyokulya bikateek:urwaho abasaija bonka
en: Displace, remove; Byasiiriira, she failed to get someone to take the food she was cooking off the fire and consequently it gotburned up; When food is cooked for a party it is the men who help women to take food ofT fire (off cooking stones); It was only men who took food off the fire (from the cooking teera teerateerana stones)

source: omuyaga niguteera; omutima nigumuteera
en: Wind is blowing; His/her heart is throbbing

source: teera
en: To beat. Strike, play

source: akakule; I.akakwazo; t. akairimira; t. amabega; /. ekiikoohe; t. ekikule; t. ensibo; t. amasa; t. oburaro; /. omuku; t. omusindo; t.orubugo; t. orujali; t. oruhi; 1. orunyege; t. omuhanda; t.enkaito
en: Laugh loudly; Burst out laugrung; Run very fast, tum a somersault; Tum the back on; Sigh (when tired); Blow a born; Remould an old pot; Beat the air; Make a bridge; Bellow (bull), shut; Stamp the foot; Make a barkcloth; Make merry; T. Empi, slap, hit with flat of band; Dance; Make a journey; Polish shoes

source: teerana
en: To be together, be in agreement, have sexual intercourse, make alliance with

source: -omuruganda rwabo tibateerana
en: -They do not agree with each other in their clan

source: teerangana
en: To beat one another

source: tecraniza
en: To bring into agreement, unite, make peace

source: omusaija n 'omukazi habw 'okuba baceke omukuru akobateeraniriza muka yabo
en: Both the man and the woman being weak, the priest married them at their home

source: teerateerana
en: Collide

source: 1110/oka zikira kuteerateeranira omubyezigooro; ekiteerateeraniza motoka nukwo kwirokira hanziriga enyingi muno omubyezigooro
en: Motor cars often collid in comers; It is overdriving while in comers that causes motor cars to collide

source: teereerra
en: Lo enjoin, stir up urge

source: akabateereerra kutaikirizaaga omwana we weena kugenda ekiro; omusomesa akabateerereerra kim11 kutaijaga b01ajll'aire nkairo; bateereriinve kwikara omunyikiriza yabo
en: He/she enjoined them not to allow any of his/her children to travel at night; The teacher enjoined them not under any circumstance should they come to school without wearing shoes; They have been enjoined to remain faithful to their faith

source: teerereza
en: To deny, oppose, contradict

source: akateererereza omumaiso g 'omucwi weemisango nkook11 atarakikozire
en: He/ she denied before the magistrate ever committing such an offence

source: teereza
en: , of teera

source: omuntu amaju; amaju akagamllteerereza omukaju aka akaba atamkusobora kutaahamu atatiize maju; akaju kafimzire nuko kaamumuteerezeseze amaju
en: To kneel before a person; He made him kneel before him/her when entering into a small but which he could not enter without kneeling; It was lhe small hut that made him kneel before him

source: teerra
en: To be slippery, be smooth, slide, glide

source: omuhanda gurumu ebisaabu guteerra
en: A muddy path is ever slippery

source: tega
en: I

source: omwinvarro akarugamu atakategere; t. enkarwa; ekiraba haigunt bakitegera hansi; ebisoro eby'amaani muno babitegesa ornuliiti
en: Akategera omuka, he/she left hospital before he/she was fully recovered from illness, he/she was fully recovered after he/she had gone home. Tega, ku-, oku -, v.tr; Trip up in wrestling; A flying object is trapped from the ground: c. Form, tegesa, k11-, oku-; Strong animals are trapped with a lasso made of sisal

source: tegana
en: To be very busy, be bothered

source: teganiza
en: To trouble, worry

source: tegeekaniza
en: To make an attempt

source: tegeijuka
en: To grow luxuriantly

source: tegeizira
en: =/oreg

source: tegeka
en: To arrange, prepare

source: tegereza
en: To wait for expectantly

source: omufumu abarwaire bakamutegerereza aheeru y 'ekisiika /eye; bakabiiltirwa tcgura temb kubategererezesa busa omuge11yi atarasoboirekwija; mukun1 w 'ihanga akategerezibwa abontu yaraganiize kubungira
en: The patients waited for the doctor from outside his consuJtation room; Theywere disappointed by having been made to wait for a visitor who never turned up; The head of state was awaited for by the people he had promised to visit

source: tegura
en: To put in the proper place

source: nooyetaaga omuheereza ow 'okukuteguruurraaga engoye zamve; genda oteguze mugenzi waawe ebintu baliiriireho
en: Do you need a servant responsible for putting your clothes in their proper place?; Go and help your brother put away the thingsthey have used at meal

source: teguurra
en: Pr.,(p f. -tegurwire)

source: omutego bakaba bategere
en: Omunyoro akagubateguniza, the chief made them unset the trap which they bad set

source: teka
en: To be level, straight. Teke, e-, n.cl.9,{pl. Nil)

source: televizoni
en: Cl.9

source: tema
en: To be crooked (weaving of mat)

source: banza osambuu"e omukeeka ohike eldikaro gutemiiremu nukwo oguterekereze; ob oruka omukeeka otagumize enkindo ogutemya; tali niinyowe atemeze omukeeka gwawe; t. ekiteega; naaseerra aw'okumwemere emifiye; enjoka ekamutemera omum11siri naalima; abasaija emiti bagitemeseze e11de11111; ayatemerwe enjoka atiina omunya
en: Unravel the mat first up to the spot where it started going crooked and then start putting it straight; When you weave a mat without firmly fixing the palm leaves it goes crooked; Gutemiibwe omukazi ayaba naaguruka, it is not f who made your mat crooked, it is the woman who has been weaving it. Tema, ku -, oku-, v.tr; Bite the leg; Ekuzire muno, she is looking for someone to cut down her trees as they have over grown; The snake bit her while in the garden digging; The men used an axe to fell the trees; He/ she that was once bitten by a snake will run away from a lizard

source: tematemura
en: To tear to pieces

source: ekiniga kikamutemuza ebbaruha ezi akaba amuhandiikiire; emiti y'ebijuma abaana bagitembera tembeeka temeerra kugicwaho ebijuma byayo; embogo =ikabatembesa omuti
en: Indignation made him/her to tear the letters which he he/she had written to him/her; Children climb fruit trees so that they may pick fruit from them; The buffaloes made them climb a tree

source: tembccka
en: To accuse falsely

source: 0111ura11111zi akakizoora nkooku eki11111yamugambireho eki akaba akinmtembeekere kwonka
en: The arbitrator realized that what he/she said about him/ her was false

source: tembeerra
en: To climb up to

source: noobu e11seene11e baazaahuragaliaiguru kwinganaki
en: Omusuma yasoboraga kuzitembeerra akaziiba, however, high grasshoppers would be kept, a thief would still climb up to steal them

source: nyineeka aJemberiirwe nuwe ogu ow'omusaija mugenzi we aihireho mulcazi we
en: It is the bead of the house that is held with contempt that is deprived of his wife by another man

source: tembekaniza
en: To pile up in a heap. Tembekerana, ku-, olru-, v.tr

source: tembura
en: To build in a new place

source: temburuka
en: To come down, descend, get out of bed

source: omwana mukuru tayetaaga muntu ow 'okumutemburuya hakitabu
en: A grown up child does not require a person for putting him/her down the bed

source: tembya
en: To cause to ascend, raise, hoist

source: ebendera y 'ekitebe rundi ey 'ihanga bagitembya nyenkya bagihanuura rwebagyo
en: The flag of an organization or of a nation is hoisted in the morning and unhoisted in the evening

source: temeerra
en: 2, {pf. - temeriire)

source: naaseerra omuntu w 'okummemereerra ebitooke; abanyoro bakasanga ebitooke bye biri omwirungu; ebitooke bye byamara emyaka ebiri bitakatemererwaga
en: He/she is looking for a person to free his/her banana plantation of weeds; Babimutemereza, the chiefs found his/her banana plantation overgrown with weeds and they forced him/her to free it of them, pass. Form, temererwa, ku-, oku-; His/her banana plantation has spent two years without being freed of weeds. Tengeetera tereza omusisa obu g111eera ensi yoona etengeeta, when the ea11hquake passes by, the earth qunkes

source: tengeetera
en: : to tremble, be shaky (as fromage).abcm111 tibalyanabakobaabo habw ·ok1111111a kutengeetera, people do not eat with their sons in-law for fear of getting a shaking disease

source: tengeneka
en: To steady, balance

source: tenta
en: To roll

source: ekinfll kitentera nambere haba heculikire; Wakame yatensaaga ebibaale bigya bileera ayabaga aizire kumukwata
en: Something rolls where there is a slope; Wakame used to roll stones down the slope and hit those who came to arrest him

source: tentebuka
en: To descend hill with

source: leka kungambisa akasozi nikantentebukya
en: Stop making me speak as the slope of a hill is forcing me to fall forward. Teoteerra, ku-, oku, v.i

source: terebera
en: To be indolent, sit doing nothing

source: akaterebeerra kutaba na numtu w 'okumwekambisa kukora emirimo; omunlu kwikara omukitabu abyamire esaaha zoona kimuterebeza; ogu akaterebezibwa obugara
en: He/ she became indolent because be/she did not have anyone to encourage him/her to work; Keeping in bed all the time makes one indolent; Laziness made him/her indolent

source: terebuka
en: To slip, slide

source: akaterebukira hakasozi yagwa yahe11deka; akaba naija kwombeka omurubuga abazaire be baamuterebura
en: He/she slid while descending a hill and fell down and got a fracture. Terebura, ku-,.oku-, v.tr; Be was going to build in town but his parents discouraged him

source: tereekeerra
en: To be straight, flat, level

source: enju enyakwombekerwe hansi etereekeriire etwara sellle nke
en: A house that is built on a leveled ground costs little money

source: tereoganiza
en: To lie, talk deceitfully

source: abantu baJerenganiriza obutamanya
en: People talk deceitfully out of ignorance

source: tercza
en: To cause to slip

source: temera
en: To sow or plant one by one

source: obu okaba orwaire obotao/11 11ubo boomutemeriire ebihimbo bye; obokozi bagen:u benubo baomulemiize ebihimba bye; ebihimba bye bikatemerwa obaraahi
en: When she was sick, it was the neighbours who planted her beans; It is her fellow women who helped her plant the beans for her; Her beans were planted by the neighbours

source: temuka
en: To become tom, rent

source: temura
en: Lr

source: okomunyegeerra hobw 'okumutemuurro ekiteeteei; ekiniga kikamutemuza ebboruho yamuhondiikiraga zoona
en: She accused him for tearing her dress; Indignation made her tear all the correspondences he used to receive from him

source: teoda
en: Weave (engora)

source: abatenzi batendeso enkindo nmdi e11duko
en: Abahunzi bolwndiso enkwozi, people who ornament sticks do so with leaves while those who adorn objects do so with beads

source: teodcbeka
en: To put in a difficult position, give an impossible task

source: amutendebekere egaoli enyalmfiire yatumkya sente ezi ateetegekere
en: He trickly gave hnn a faulty bicycle which put him into unnecessary expense

source: tendeka
en: To initiate, educate

source: tencekana
en: I., ( pf. -teneekaine)

source: teoeekaniza
en: C

source: teneka
en: {pf. -tcnekere)

source: mwije muntenekere omusiri gwange gunu; enfuka ya kidim11 niyo ebo mmgi kutenekesa omusiri
en: Come and dig my garden by turning over clods; It is a broad bladed hoe that is suitable for turning over clods in digging

source: tenga
en: To get ready to fight or dance

source: tengeerra
en: To exclaim, exaggerate, overpraise (supposed to bring bad luck), obantu abandi obu bakora ekintu kinmgi tibagonza kubatengeerra, some people do not want to be over praised when do something good

source: tengeesa
en: To shake, tilt

source: tengeeta
en: To shake, quake, fidget, roll (boat)

source: orubengo nve bakaruterereza omubugenyi
en: Her grinding stone was made slippery at the wedding (by grinding wrong stuff on it)

source: teruka
en: To be poor (soil)

source: obu yaboine omusango okugurukwija kum11si11ga ebigambo yabiterukaho
en: When he realized·that the case would end up against him/her, he/ she decided to slip away from it

source: terura
en: Rr

source: teruurra
en: To give (milk, coffee berries)

source: tesa
en: To pet, make much of

source: teta
en: To be carefree, begin to talk (as a little child)

source: abaana abaingi obu baba nibateta
en: Bate/era hakigambo "taata". Many of the children when they are beginning to talk will begin with sound "taata" (father), but see below

source: teteerwa
en: To be undecided, waver, hesitate

source: omuntu obu aba naija kukora ekintu omutima gwe gukateteenva eki aba naagya kukora akireka
en: When a person is about to do something and his/her heart hesitates, he/she gives upthe idea

source: tetera
en: To give to (used of a young child)
